[{"encounter_id": "ENC00908", "responses": [{"content_en": " It should be a skin disease caused by an allergic reaction. Oral antihistamines should be taken, and topical corticosteroids should be used. It should be a skin disease caused by contact with an object."}]}, {"encounter_id": "ENC00909", "responses": [{"content_en": " The possibility of tinea corporis is relatively high, so a fungal examination of the skin flakes should be conducted. It is folliculitis."}]}, {"encounter_id": "ENC00910", "responses": [{"content_en": " It is recommended to use miconazole nitrate for tinea manus. It is recommended to use miconazole nitrate for tinea manus."}]}, {"encounter_id": "ENC00911", "responses": [{"content_en": " It should be eczema, in my personal opinion. It should be eczema, it would be best to check for allergens. It should be eczema, in my personal opinion."}]}, {"encounter_id": "ENC00912", "responses": [{"content_en": " It is recommended to first perform a pathology to rule out MF. It is recommended to first perform a pathology to rule out MF. It is recommended to first perform a pathology to rule out MF. It is recommended to first perform a pathology to rule out MF."}]}, {"encounter_id": "ENC00913", "responses": [{"content_en": " You can try applying Baidobang externally three times a day. It is a Chinese herbal medicine for promoting blood circulation and removing blood stasis. You can try applying Baidobang externally three times a day. It is a Chinese herbal medicine for promoting blood circulation and removing blood stasis. You can try applying Baidobang externally three times a day. It is a Chinese herbal medicine for promoting blood circulation and removing blood stasis. You can try applying Baidobang externally three times a day. It is a Chinese herbal medicine for promoting blood circulation and removing blood stasis."}]}, {"encounter_id": "ENC00914", "responses": [{"content_en": " It is recommended to first test for fungus, then consider palmoplantar keratoderma. Eczema It is recommended to first test for fungus, then consider palmoplantar keratoderma. It is recommended to first test for fungus, then consider palmoplantar keratoderma. It is recommended to first test for fungus, then consider palmoplantar keratoderma."}]}, {"encounter_id": "ENC00915", "responses": [{"content_en": " Chronic urticaria can be cured by traditional Chinese medicine. Chronic urticaria can be cured by traditional Chinese medicine. It is urticaria."}]}, {"encounter_id": "ENC00916", "responses": [{"content_en": " It should be tinea versicolor. It should be tinea versicolor. It is not tinea versicolor."}]}, {"encounter_id": "ENC00917", "responses": [{"content_en": " Psoriasis"}]}, {"encounter_id": "ENC00918", "responses": [{"content_en": " It should be folliculitis. It should be folliculitis. It should be folliculitis. It should be folliculitis. It should be folliculitis."}]}, {"encounter_id": "ENC00919", "responses": [{"content_en": " It's not very clear, but it seems like there is a bit of dandruff. It's not very clear, but it seems like there is a bit of redness and inflammation.\nYou can use some topical corticosteroids. It's not very clear, but it seems like there is a bit of dandruff. It's not very clear, but it seems like there is a bit of dandruff."}]}, {"encounter_id": "ENC00920", "responses": [{"content_en": " Exfoliative Keratolysis Exfoliative keratolysis? Exfoliative keratolysis? Exfoliative Keratolysis"}]}, {"encounter_id": "ENC00921", "responses": [{"content_en": " It's clearly insect bite dermatitis."}]}, {"encounter_id": "ENC00922", "responses": [{"content_en": " It is a callus caused by friction. It is a callus caused by friction. It is a callus caused by friction. It is a callus caused by friction."}]}, {"encounter_id": "ENC00923", "responses": [{"content_en": " Tinea manus, also known as eczema, is a disease characterized by dry skin, and is common in women. It is related to long-term contact with water, and can be cured by moisturizing and anti-allergy treatment."}]}, {"encounter_id": "ENC00924", "responses": [{"content_en": " Considering drug rash Considering drug rash Considering drug rash? Considering drug rash? Considering drug rash? Considering drug rash?"}]}, {"encounter_id": "ENC00925", "responses": [{"content_en": " Consider whether there is a lesion under the skin, the specific direction is difficult to consider."}]}, {"encounter_id": "ENC00926", "responses": [{"content_en": " Urticaria, it is recommended to take and apply the traditional Chinese medicine Longdan Xiegan Decoction with appropriate modifications. Urticaria, it is recommended to take and apply the traditional Chinese medicine Longdan Xiegan Decoction with appropriate modifications. Urticaria, it is recommended to take and apply the traditional Chinese medicine Longdan Xiegan Decoction with appropriate modifications. Urticaria, it is recommended to take and apply the traditional Chinese medicine Longdan Xiegan Decoction with appropriate modifications."}]}, {"encounter_id": "ENC00927", "responses": [{"content_en": " Psoriasis Psoriasis Psoriasis"}]}, {"encounter_id": "ENC00928", "responses": [{"content_en": " It is, in fact, a case of ringworm. It is similar to what the previous patient had. The previous patient had a high fever, and the disease course was longer. The current patient's disease course is only a few days, and it is suspected to be a drug rash. The previous patient's disease course was only a few days, and it is suspected to be an outbreak of Beriberi. The previous patient's disease course was only a few days, and it is suspected to be an outbreak of athlete's foot. The previous patient's disease course was only a few days, and it is suspected to be an outbreak of tinea pedis. The previous patient's disease course was only a few days, and it is suspected to be an outbreak of ringworm. The previous patient's disease course was only a few days, and it is suspected to be an outbreak of scabies. It is indeed multiline erythema. It is, in fact, a case of Beriberi. It is indeed multiline erythema. It is, in fact, a rash with multiple lines. This is not like the skin lesions of the disease. I have never seen it like this before. I suggest we do a pathology test to check."}]}, {"encounter_id": "ENC00929", "responses": [{"content_en": " It is a skin tumor, but the big tumor is not clearly visible. You can first perform a pathology to confirm the diagnosis, and then consider the possibility of a malignant melanoma. It is a skin tumor, but the medical history does not allow for such a diagnosis. It is more likely to be a fibroma. It's still skin cancer. You can remove it and it will be fine. Don't forget to check the lymph nodes. If they're positive, you need to do a biopsy. It's better to do it now than later. Don't delay it as long as possible. The survival rate is high. It is a skin tag, which can be removed by surgery."}]}, {"encounter_id": "ENC00930", "responses": [{"content_en": " Psoriasis Tinea capitis, also known as seborrheic dermatitis. Tinea capitis, also known as seborrheic dermatitis. Consider psoriasis Psoriasis Psoriasis"}]}, {"encounter_id": "ENC00931", "responses": [{"content_en": " It should be eczema. It should be contact dermatitis. It should be eczema."}]}, {"encounter_id": "ENC00932", "responses": [{"content_en": " Onychomycosis, nail detachment? Onychomycosis, nail detachment? Onychomycosis, nail detachment?"}]}, {"encounter_id": "ENC00933", "responses": [{"content_en": " It is a chronic eczema."}]}, {"encounter_id": "ENC00934", "responses": [{"content_en": " It's unclear, is it urticaria or psoriasis? It's unclear, is it urticaria or psoriasis?"}]}, {"encounter_id": "ENC00935", "responses": [{"content_en": " It is recommended to check for fungus to rule out tinea versicolor. The image is unclear.\nIf it is possible to rule out the possibility of a skin tumor through pathology, then the treatment can be focused on relieving itching and improving the appearance of the rash."}]}, {"encounter_id": "ENC00936", "responses": [{"content_en": " It should be psoriasis. It should be a type of papule."}]}, {"encounter_id": "ENC00937", "responses": [{"content_en": " The possibility of cheilitis is high. It is recommended to first test for fungus, then consider eczema. The possibility of cheilitis is high. The diagnosis is clear. However, the treatment for this disease is not very straightforward. It requires a comprehensive treatment plan. It is recommended to first clear heat and detoxify, then use topical medications such as retinoic acid and vitamin E. If there is no exudation, oral medications such as prednisone and antihistamines can be taken. The treatment should be continuous. It is suggested to have a follow-up visit after 6 months to monitor the progress. The possibility of cheilitis is high."}]}, {"encounter_id": "ENC00938", "responses": [{"content_en": " Considering pruritus, the rash appears to be caused by long-term scratching, leading to punctate scabs, scratch marks, and thickening of the skin. It is best to rule out diabetes and systemic organ functions such as liver and kidney functions. Considering pruritus, the rash appears to be caused by long-term scratching, leading to punctate scabs, scratch marks, and thickening of the skin. It is best to rule out diabetes and systemic organ functions such as liver and kidney functions. Considering neurodermatitis Considering neurodermatitis Considering neurodermatitis"}]}, {"encounter_id": "ENC00939", "responses": [{"content_en": " It is recommended to use traditional Chinese medicine for treatment, which can clear heat and dry dampness, and relieve itching by removing dampness."}]}, {"encounter_id": "ENC00940", "responses": [{"content_en": " It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of skin tumor. It can be treated with cryotherapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy. It is a vascular nevus, which is a type of vascular tumor. It can be treated with laser therapy."}]}, {"encounter_id": "ENC00941", "responses": [{"content_en": " It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema. It is recommended to first test for fungus, then consider eczema."}]}, {"encounter_id": "ENC00942", "responses": [{"content_en": " It is a skin tag."}]}, {"encounter_id": "ENC00943", "responses": [{"content_en": " It is recommended to first test for anti-TP and rheumatoid factor. It is recommended to first check the blood sugar level and blood lipids at the same time. It is recommended to first check the blood sugar level and blood lipids at the same time. It is recommended to first test for anti-TP and rheumatoid factor. It is recommended to first test for anti-TP and rheumatoid factor."}]}, {"encounter_id": "ENC00944", "responses": [{"content_en": " Papular urticaria Papular urticaria Papular urticaria"}]}, {"encounter_id": "ENC00945", "responses": [{"content_en": " It's an eye mite infection. Use Isoformin for external use. It's an eye mite infection. Use Isoformin for external use."}]}, {"encounter_id": "ENC00946", "responses": [{"content_en": " It should be folliculitis. It should be folliculitis."}]}, {"encounter_id": "ENC00947", "responses": [{"content_en": " It is a blister caused by a viral infection. Oral antiviral medication (for children) should be taken. Topical antiviral medication can be used externally.\nIt is recommended to use a cold compress with a solution of 1/8000 potassium permanganate and 1/8000 dijon mustard for external use.\nThe blister will heal on its own within a few days to weeks. It is suggested to avoid scratching and to keep the affected area clean. It is a blister caused by the combined effects of viral infection and bacterial infection. It is recommended to use antiviral and bacterial drugs simultaneously. The blister is not yet well formed, it is recommended to apply a heat-clearing and detoxifying Chinese medicine ointment externally."}]}, {"encounter_id": "ENC00948", "responses": [{"content_en": " Palmoplantar Keratoderma The possibility of eczema is high, a biopsy should be taken. The possibility of eczema is high, it is recommended to check for fungus. The possibility of eczema is high, it is recommended to check for fungus. The possibility of eczema is high, a biopsy should be taken. The possibility of eczema is high, a biopsy should be taken. The possibility of eczema is high, a biopsy should be taken."}]}, {"encounter_id": "ENC00949", "responses": [{"content_en": " Rosacea, not pityriasis rosea."}]}, {"encounter_id": "ENC00950", "responses": [{"content_en": " Papular urticaria Papular urticaria Papular urticaria"}]}, {"encounter_id": "ENC00951", "responses": [{"content_en": " It is recommended to first test for fungus, then consider palmoplantar keratoderma."}]}, {"encounter_id": "ENC00952", "responses": [{"content_en": " It should be eczema, in my personal opinion. It should be eczema, but because your location is in the hospital, it's hard to treat, especially if it's related to infections. It should be eczema, but because your location is in the hospital, it's hard to treat, especially if it's related to infections."}]}, {"encounter_id": "ENC00953", "responses": [{"content_en": " Papular urticaria"}]}, {"encounter_id": "ENC00954", "responses": [{"content_en": " The area is not large, it can be treated with retinoic acid ointment. The image is unclear.\nIf it's clear, it's probably a rash caused by an allergic reaction.\nIf it's not clear, it might be a skin lesion due to an infectious disease, such as shingles."}]}, {"encounter_id": "ENC00955", "responses": [{"content_en": " It should be dermatitis. It should be allergic purpura. You can take oral Chlorpheniramine and Cetirizine, and apply topical Lushigan stone lotion externally."}]}, {"encounter_id": "ENC00956", "responses": [{"content_en": " It is recommended to use a different type of medication, such as terbinafine cream for external use. It is recommended to use a different type of medication, such as terbinafine cream for external use."}]}, {"encounter_id": "ENC00957", "responses": [{"content_en": " It is recommended to do a fungal examination to rule out the possibility of tinea versicolor. It is recommended to do a fungal examination to rule out the possibility of tinea versicolor."}]}, {"encounter_id": "ENC00958", "responses": [{"content_en": " The possibility of ulcers is high, and it is recommended to check for fungus. The possibility of ulcers is high, and it is recommended to check for fungus."}]}, {"encounter_id": "ENC00959", "responses": [{"content_en": " Papular urticaria"}]}, {"encounter_id": "ENC00960", "responses": [{"content_en": " Nodular rash Nodular rash. Nodular rash. Nodular rash. Nodular rash. Nodular rash Nodular rash. Nodular rash. Nodular rash. Nodular rash."}]}, {"encounter_id": "ENC00961", "responses": [{"content_en": " It seems like eczema, but it's best to do a pathology test. It seems like eczema, but it's best to do a pathology test."}]}, {"encounter_id": "ENC00962", "responses": [{"content_en": " Papular urticaria Papular urticaria"}]}, {"encounter_id": "ENC00963", "responses": [{"content_en": " It should be a type of allergic dermatitis, right? It should be a type of allergic dermatitis, right? It should be a type of allergic dermatitis, right? It should be a type of allergic dermatitis, right? It should be a type of allergic dermatitis, right? It should be a type of allergic dermatitis, right?"}]}, {"encounter_id": "ENC00964", "responses": [{"content_en": " It is recommended to go to the hospital for a rheumatoid test. It is recommended to have a comprehensive physical examination and a dermatopathology for the skin lesions."}]}, {"encounter_id": "ENC00965", "responses": [{"content_en": " It should be a scalp granuloma. It is recommended to test for fungus."}]}, {"encounter_id": "ENC00966", "responses": [{"content_en": " Disulfurosis dermatitis, apply a small amount of Dime once. Disulfurosis dermatitis, apply a small amount of Dime once."}]}, {"encounter_id": "ENC00967", "responses": [{"content_en": " It is recommended to first test for anti-O, then consider vasculitis. It is recommended to first test for anti-O, then consider vasculitis. It is recommended to first test for anti-O, then consider vasculitis."}]}, {"encounter_id": "ENC00968", "responses": [{"content_en": " It is a type of anemia, the treatment is not very satisfactory. It is a bit like vitiligo. It is achromic nevus, a type of pigment reduction nevus, and does not require treatment. Some may even develop achromic nevus into achromic nevus. Fungal smear does not show any. It is only through achromic nevus that achromic nevus can be seen. It is a type of anemic nevus, which can be treated with cryotherapy."}]}, {"encounter_id": "ENC00969", "responses": [{"content_en": " It should be herpes simplex. It should be herpes simplex. Herpes simplex. Herpes simplex."}]}, {"encounter_id": "ENC00970", "responses": [{"content_en": " It is recommended to first test for fungus. It is recommended to first test for fungus. It is recommended to first test for fungus. It is recommended to first test for fungus. It is recommended to check for fungus."}]}, {"encounter_id": "ENC00971", "responses": [{"content_en": " The image is unclear.\nIf it's verrucous, it's best to do a pathology test to rule out basal cell carcinoma. The image is unclear.\nIf it's verrucous, it's best to do a pathology test to rule out basal cell carcinoma."}]}, {"encounter_id": "ENC00972", "responses": [{"content_en": " It's not nail fungus, it's more like nail discoloration. It's not nail fungus, it's more like nail discoloration. It's not nail fungus, it's more like nail discoloration. It's not nail fungus, it's more like nail discoloration. It's not nail fungus, it's more like nail discoloration."}]}, {"encounter_id": "ENC00973", "responses": [{"content_en": " It should be allergic purpura, right? It should be allergic purpura, right? It should be allergic purpura, right? It should be allergic purpura, right? It should be allergic purpura. It should be allergic purpura."}]}, {"encounter_id": "ENC00974", "responses": [{"content_en": " It should be eczema. It should be eczema. It should be eczema. It should be eczema."}]}, {"encounter_id": "ENC00975", "responses": [{"content_en": " Consider tinea manuum (hand ringworm). Test for fungus. Consider tinea manuum (hand ringworm). Test for fungus. Consider tinea pedis (Athlete's foot). Test for fungus. Consider tinea pedis (Athlete's Foot). Test for fungus. Consider tinea pedis (Athlete's Foot). Test for fungus. Consider tinea pedis (Athlete's Foot). Test for fungus. Consider tinea pedis (Athlete's Foot). Test for fungus."}]}, {"encounter_id": "ENC00976", "responses": [{"content_en": " The possibility of tinea corporis is high, it is recommended to check for fungus. The possibility of tinea corporis is high, it is recommended to check for fungus."}]}, {"encounter_id": "ENC00977", "responses": [{"content_en": " Papular urticaria It should be a Type 4 allergic reaction. It should be a Type 4 allergic reaction. It is recommended to use traditional Chinese medicine for treatment, which can clear heat and dry dampness, and relieve itching by removing dampness."}]}, {"encounter_id": "ENC00978", "responses": [{"content_en": " It is herpes zoster, there is no need to worry. It is herpes zoster, there is no need to worry, it can be treated with antiviral drugs. It is herpes zoster, there is no need to worry, it can be treated with antiviral drugs. It is herpes zoster, there is no need to worry, it can be treated with antiviral drugs."}]}, {"encounter_id": "ENC00979", "responses": [{"content_en": " It should be eczema. It should be eczema."}]}, {"encounter_id": "ENC00980", "responses": [{"content_en": " The possibility of tinea simplex is high. The possibility of rosacea is high. The possibility of herpes simplex is high."}]}, {"encounter_id": "ENC00981", "responses": [{"content_en": " It is recommended to use traditional Chinese medicine for treatment, which can clear heat and dry dampness, and relieve itching by removing dampness."}]}, {"encounter_id": "ENC00982", "responses": [{"content_en": " Chronic eczema. Chronic eczema. Chronic eczema. Chronic eczema."}]}, {"encounter_id": "ENC00983", "responses": [{"content_en": " It's not contagious, it's just a hard wart. It's not contagious, it's just a hard wart. It's not contagious, it's just a bit hard."}]}, {"encounter_id": "ENC00984", "responses": [{"content_en": " Tinea corporis Tinea cruris Tinea cruris"}]}, {"encounter_id": "ENC00985", "responses": [{"content_en": " Chronic urticaria Chronic urticaria"}]}, {"encounter_id": "ENC00986", "responses": [{"content_en": " It should be papular urticaria. It should be papular urticaria. It should be papular urticaria. It should be parapsoriasis. It should be parapsoriasis."}]}, {"encounter_id": "ENC00987", "responses": [{"content_en": " Could it be amyloidosis of the skin?"}]}, {"encounter_id": "ENC00988", "responses": [{"content_en": " It is recommended to first perform a skin pathology to rule out basal cell carcinoma. It's like a wart, right?"}]}, {"encounter_id": "ENC00989", "responses": [{"content_en": " It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag. It is a skin tag."}]}, {"encounter_id": "ENC00990", "responses": [{"content_en": " Contact dermatitis, apply Wuji ointment externally, take orally antihistamines. Contact Dermatitis Contact Dermatitis"}]}, {"encounter_id": "ENC00991", "responses": [{"content_en": " It should be a case of tinea corporis. It should be a case of tinea corporis. It should be a case of tinea corporis. It should be a skin mole."}]}, {"encounter_id": "ENC00992", "responses": [{"content_en": " It should be a papule. If it is a blister, it should be a bullous papule. It should be a papule. If it is a blister, it should be a bullous papule. It should be an allergic dermatitis caused by scratching. It is recommended to use topical corticosteroid ointment. It should be an allergic purpura. You can use Lushen Stone lotion externally, and it should be okay. You can also take oral antihistamines."}]}, {"encounter_id": "ENC00993", "responses": [{"content_en": " Chronic eczema. Chronic Acrodermatitis"}]}, {"encounter_id": "ENC00994", "responses": [{"content_en": " It is a skin tumor, it should be treated with surgery."}]}, {"encounter_id": "ENC00995", "responses": [{"content_en": " The possibility of tinea corporis is high, it is recommended to check for fungus. The possibility of tinea corporis is high, it is recommended to check for fungus."}]}, {"encounter_id": "ENC00996", "responses": [{"content_en": " The image is unclear.\nIf it is urticaria, you can use Chlorpheniramine."}]}, {"encounter_id": "ENC00997", "responses": [{"content_en": " It should be a case of tinea pedis. Oral antifungal medication should be taken. Topical antifungal medication can be used. Hand, foot and mouth disease? Hand, foot and mouth disease?"}]}, {"encounter_id": "ENC00998", "responses": [{"content_en": " Urticarial papules. Topical application of Lugen Shi lotion is effective."}]}, {"encounter_id": "ENC00999", "responses": [{"content_en": " It should be a white spot, not vitiligo. It is recommended to go to the hospital for a check-up."}]}, {"encounter_id": "ENC01000", "responses": [{"content_en": " Miliaria Miliaria"}]}, {"encounter_id": "ENC01001", "responses": [{"content_en": " It is a scurf. It is a scurf. It is a scurf."}]}, {"encounter_id": "ENC01002", "responses": [{"content_en": " It is recommended to check for fungus, otherwise it may continue to spread. It is recommended to check for fungus, otherwise it may continue to spread."}]}, {"encounter_id": "ENC01003", "responses": [{"content_en": " Contact Dermatitis"}]}, {"encounter_id": "ENC01004", "responses": [{"content_en": " It should be allergic purpura. You can take oral Chlorpheniramine and Prednisone, and apply topical Parison. If there is no exudation, you don't need to use topical steroid ointment. It should be a skin lesion caused by an allergic reaction. Take some antihistamines orally, such as cetirizine, loratadine, levocetirizine, desloratadine, mizolastine, etc. It should be allergic purpura. You can take oral Chlorpheniramine and Prednisone, and apply topical Parison. If there is no exudation, you don't need to use topical steroid ointment."}]}, {"encounter_id": "ENC01005", "responses": [{"content_en": " It should be allergic purpura. You can take oral Chlorpheniramine and antihistamines, and apply Wuji ointment externally. It should be allergic purpura. You can take oral antihistamines and apply topical steroid ointment."}]}, {"encounter_id": "ENC01006", "responses": [{"content_en": " It should be folliculitis. It should be folliculitis."}]}, {"encounter_id": "ENC01007", "responses": [{"content_en": " The red nevus on the chest is a skin tumor, and the small red nevus on the back is a hemangioma. The skin lesion on the back is caused by the enlargement of capillaries due to inflammation."}]}]